#支付平台接口

#刷卡支付
pay_url=http://172.20.16.250:80/rest/pay/trade_pay
#支付结果查询
orderquery=http://172.20.16.250:80/rest/pay/orderquery
#获取支付URL
signUrlCode=http://172.20.16.250:80/rest/pay/signUrlCode
#退款接口
refund=http://172.20.16.250:80/rest/pay/refund
#12580支付链接
paypage=http://172.20.16.250:80/rest/pay/payPage

#回调地址

#测试12580回调接口
CallBack=http://172.20.44.61:8080/register-payplatform/rest/pay/callback
#测试膏方回调接口
callCreamBack=http://172.20.44.61:8080/register-payplatform/rest/pay/callCreamBack


#发送短信相关配置 【过时】
#该短信对应应用ID
ApplicationID=P000000000000041
#消息类型 0: ASCII 4: Binary 8: usc2 15: gb2312 16:gb18030a，一般选择15，普通文本短信
msgFmt=15
#是否需要状态报告 1：需要 0：不需要
reqDeliveryReport=1
#0-普通短信 1-普通短信立即显示 2-长短信组包 3-带结构短信
sendMethod=2


#返回URL域名和端口
domain=pay.jshtcm.com
port=
termOfValidity =600
#短信模板

#支付链接短信
msg=\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName @scheduleDate@timeFlag @serialNum\u3002\u8BF7\u572810\u5206\u949F\u5185\u5B8C\u6210\u652F\u4ED8\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\uFF0C\u4ED8\u6B3E\u94FE\u63A5 @url
msg1=\u5C0A\u656C\u7684@patname,\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName @scheduleDate@timeFlag@serialNum\uFF0C\u672C\u6B21\u95E8\u8BCA\u53F7\u7801@patindex \uFF0C\u5019\u8BCA\u65F6\u95F4@time\u3002\u590D\u8BCA(\u81EA\u8D39\u3001\u533B\u4FDD)\u60A3\u8005\u53EF\u6309\u65F6\u76F4\u63A5\u5230\u8BCA\u5BA4\u5019\u8BCA\uFF0C\u590D\u8BCA\u516C\u8D39\u60A3\u8005\u5148\u5230\u533B\u9662\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u8FDB\u884C\u8EAB\u4EFD\u9A8C\u8BC1\uFF08\u4EBA\u8BC1\u76F8\u7B26\uFF09\uFF0C\u521D\u8BCA\u60A3\u8005\u8BF7\u643A\u5E26\u8EAB\u4EFD\u8BC1\u63D0\u524D20\u5206\u949F\u5230\u95E8\u8BCA\u603B\u670D\u52A1\u53F0\u6838\u5BF9\u8EAB\u4EFD\u4FE1\u606F\u540E\u518D\u81F3\u8BCA\u5BA4\u5019\u8BCA\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u62E8\u6253025-12580\u7535\u8BDD\u544A\u77E5
#12580退款通知短信
msg2=\u60A8\u5DF2\u6210\u529F\u9000\u7EA6\u6211\u9662@deptName@doctorName @scheduleDate@timeFlag @serialNum \uFF0C\u9884\u7EA6\u6B3E\u4F1A\u9000\u81F3\u60A8\u539F\u652F\u4ED8\u6E20\u9053\uFF0C\u8BF7\u6CE8\u610F\u67E5\u6536\uFF0C\u5982\u6709\u7591\u95EE\u8BF7\u81F4\u7535 025-12580
#hcn预约成功短信模板【过时】
hcnPayTemplate=\u5C0A\u656C\u7684@patName,\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName\u533B\u751F @scheduleDate@timeFlag@serialNum\u53F7,\u672C\u6B21\u95E8\u8BCA\u53F7\u7801@patNo\uFF0C\u5019\u8BCA\u65F6\u95F4@time\u3002\u590D\u8BCA(\u81EA\u8D39\u3001\u533B\u4FDD)\u60A3\u8005\u53EF\u6309\u65F6\u76F4\u63A5\u5230\u8BCA\u533A\u5019\u8BCA\uFF0C\u590D\u8BCA\u516C\u8D39\u60A3\u8005\u5148\u5230\u533B\u9662\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u8FDB\u884C\u8EAB\u4EFD\u9A8C\u8BC1\uFF08\u4EBA\u8BC1\u76F8\u7B26\uFF09\uFF0C\u521D\u8BCA\u60A3\u8005\u8BF7\u643A\u5E26\u8EAB\u4EFD\u8BC1\u63D0\u524D20\u5206\u949F\u5230\u95E8\u8BCA\u603B\u670D\u52A1\u53F0\u3001\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u6838\u5BF9\u8EAB\u4EFD\u4FE1\u606F\u540E\u518D\u81F3\u8BCA\u533A\u5019\u8BCA\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u539F\u6E20\u9053\u53D6\u6D88\u3002

#=======================新短信模板====================================
#膏方预约成功短信模板
creamPaySuccessMsg=\u5C0A\u656C\u7684@patName\uFF08@patNo\uFF09\uFF0C\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@doctorName\u533B\u751F @scheduleDate@timeFlag\u818F\u65B9\u95E8\u8BCA@serialNum\u53F7\u3002\u6D41\u7A0B\uFF1A1\uFF0E\u5E26\u533B\u4FDD\u5361\u6216\u8EAB\u4EFD\u8BC1\u81F3\u4EBA\u5DE5\u6302\u53F7\u5904\u53D6\u53F7\uFF1B2\uFF0E\u81F3\u533B\u751F\u5904\u5F00\u818F\u65B9\uFF1B3\uFF0E\u4EA4\u8D39\uFF1B4\uFF0E\u81F3\u818F\u65B9\u670D\u52A1\u5904\u4EA4\u5904\u65B9\u3001\u529E\u5FEB\u9012\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u539F\u6E20\u9053\u53D6\u6D88\uFF0C\u4E0A\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592912:00\u524D\u53EF\u5230\u6302\u53F7\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u4E0B\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592917:00\u524D\u53EF\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002

#初诊病人支付成功发送短信模板
firstVisitPaySuccessMsg=\u5C0A\u656C\u7684@patName\uFF08@patNo\uFF09\uFF0C\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName\u533B\u751F @scheduleDate@timeFlag@serialNum\u53F7,\u7B49\u5F85\u5C31\u8BCA\u65F6\u95F4@time\uFF0C\u5C31\u8BCA\u5730\u70B9@address\u3002\u521D\u8BCA\u60A3\u8005\u8BF7\u643A\u5E26\u8EAB\u4EFD\u8BC1\u63D0\u524D\u5230\u95E8\u8BCA\u603B\u670D\u52A1\u53F0\u3001\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u6838\u5BF9\u8EAB\u4EFD\u4FE1\u606F\u540E\u518D\u81F3\u8BCA\u533A\u5019\u8BCA\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u539F\u6E20\u9053\u53D6\u6D88\uFF0C\u4E0A\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592912:00\u524D\u53EF\u4EE5\u5230\u6302\u53F7\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u4E0B\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592917:00\u524D\u53EF\u4EE5\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002

#复诊自费病人支付成功发送短信模板
nextVisitSelfPaySuccessMsg=\u5C0A\u656C\u7684@patName\uFF08@patNo\uFF09\uFF0C\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName\u533B\u751F @scheduleDate@timeFlag@serialNum\u53F7,\u7B49\u5F85\u5C31\u8BCA\u65F6\u95F4@time\uFF0C\u5C31\u8BCA\u5730\u70B9@address\u3002\u60A8\u672C\u6B21\u5C31\u8BCA\u8EAB\u4EFD\u4E3A\u81EA\u8D39\uFF0C\u5982\u6709\u53D8\u66F4\uFF0C\u8BF7\u52A1\u5FC5\u5148\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u8FDB\u884C\u8EAB\u4EFD\u9A8C\u8BC1\uFF0C\u5426\u5219\u53EA\u80FD\u6309\u7167\u81EA\u8D39\u8FDB\u884C\u7ED3\u7B97\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u539F\u6E20\u9053\u53D6\u6D88\uFF0C\u4E0A\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592912:00\u524D\u53EF\u5230\u6302\u53F7\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u4E0B\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592917:00\u524D\u53EF\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002 

#复诊非自费病人支付成功发送短信模板
nextVisitNoSelfPaySuccessMsg=\u5C0A\u656C\u7684@patName\uFF08@patNo\uFF09\uFF0C\u60A8\u5DF2\u9884\u7EA6\u6211\u9662@deptName@doctorName\u533B\u751F @scheduleDate@timeFlag@serialNum\u53F7,\u7B49\u5F85\u5C31\u8BCA\u65F6\u95F4@time\uFF0C\u5C31\u8BCA\u5730\u70B9@address\u3002\u590D\u8BCA(\u81EA\u8D39\u3001\u533B\u4FDD)\u60A3\u8005\u8BF7\u6309\u65F6\u76F4\u63A5\u5230\u8BCA\u533A\u5019\u8BCA\uFF0C\u590D\u8BCA\u516C\u8D39\u60A3\u8005\u8BF7\u5148\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u8FDB\u884C\u8EAB\u4EFD\u9A8C\u8BC1\uFF08\u4EBA\u8BC1\u76F8\u7B26\uFF09\u3002\u5982\u9700\u53D6\u6D88\u9884\u7EA6\uFF0C\u8BF7\u4E8E\u5C31\u8BCA\u524D\u4E00\u592924\u70B9\u524D\u539F\u6E20\u9053\u53D6\u6D88\uFF0C\u4E0A\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592912:00\u524D\u53EF\u5230\u6302\u53F7\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u4E0B\u5348\u7684\u9884\u7EA6\u53F7\u5C31\u8BCA\u5F53\u592917:00\u524D\u53EF\u5230\u4EBA\u5DE5\u6302\u53F7/\u6536\u8D39\u7A97\u53E3\u9000\u53F7\uFF0C\u903E\u671F\u8BE5\u53F7\u4F5C\u5E9F\u3002